% 因子分析和主成分分析法类似，都是一种提取主要影响因素的方法，但是因子分析更灵活，其解释成功的可能性远大于主成分解释成功的可能性
% 一些因子分析和主成分分析的区别：
% 1.前者中各因子的线性组合构成了原始的指标，而后者中的主成分实际上是各指标的线性组合
% 2.前者是一个伴随几个关键假设的因子模型，而后者只是简单的数值计算
% 3.前者可以有许多解，但后者的解是唯一的
% 因子分析和主成分分析都是降维方法

% ----------------------------------------------------------------------------------------------------------------------
% 1.对原始数据进行标准化处理
ssgs = [43.31 7.39 8.73 54.89 15.35
    17.11 12.13 17.29 44.25 29.69
    21.11 6.03 7 89.37 13.82
    29.55 8.62 10.13 73 14.88
    11 8.41 11.83 25.22 25.49
    17.63 13.86 15.41 36.44 10.03
    2.73 4.22 17.16 9.96 74.12
    29.11 5.44 6.09 56.26 9.85
    20.29 9.48 12.97 82.23 26.73
    3.99 4.64 9.35 13.04 50.19
    22.65 11.13 14.3 50.51 21.59
    4.43 7.3 14.36 29.04 44.74
    5.4 8.9 12.53 65.5 23.27
    7.06 2.79 5.24 19.79 40.68
    19.82 10.53 18.55 42.04 37.19
    7.26 2.99 6.99 22.72 56.58];
n = size(ssgs, 1);
x = ssgs(:, [1:4]);
y = ssgs(:, 5);
x = zscore(x);                                  % 对前四个收益指标标准化处理

% 2.计算相关系数矩阵
r = corrcoef(x);  

% 3.计算初等载荷矩阵
[vec1, val, con1] = pcacov(r)
f1 = repmat(sign(sum(vec1)), size(vec1, 1), 1);
vec2 = vec1.*f1;                                % mu
f2 = repmat(sqrt(val)', size(vec2, 1), 1);      % 根号lamda
a = vec2 .* f2                                  % 根号lamda * mu 初等载荷矩阵    

% 4.选择m个主因子
%   根据初等载荷矩阵计算出各个公共因子的贡献率，并选择m个主因子
num = input('请选择主因子个数');                     % 选择主因子个数
am = a(:, [1:num]);                                 % 提出num个主因子的载荷矩阵
[bm, t] = rotatefactors(am, 'method', 'varimax')    %am旋转变换，bm为旋转后的载荷阵
bt = [bm, a(:, [num+1:end])];                       % 旋转后全部因子的载荷矩阵，前两个旋转，后面不旋转
con2 = sum(bt.^2)                                   % 计算因子贡献
check = [con1, con2'/sum(con2) * 100]               % 该语句是领会旋转意义，con1是未旋转前的贡献率
rate = con2(1:num)/sum(con2)                        % 计算因子贡献率

% 5.计算因子得分
coef = inv(r) * bm                                  % 计算得分函数的系数
score = x * coef                                    % 计算各个因子的得分
weight = rate/sum(rate)                             % 计算得分的权重
Tscore = score * weight'                            % 对各个因子的得分进行加权求和，即求各企业的综合得分
[STscore, ind] = sort(Tscore, 'descend')            % 对企业进行排序
display = [score(ind, :)'; STscore'; ind']          % 显示排序结果
[ccoef, p] = corrcoef([Tscore, y])                  % 计算F与资产负债的相关性系数
[d, dt, e, et, stats] = regress(Tscore, [ones(n, 1), y]); % 计算F与资产负债的方程
d, stats                                            % 显示回归系数，和相关统计量的值

